---
kind: enumMember
id: F:Autodesk.Revit.DB.DistributionOfNormals.OnePerFace
enum: Autodesk.Revit.DB.DistributionOfNormals
source: html/8e00e7aa-b39b-51b4-26e4-0f5c1404df32.htm
---
# Autodesk.Revit.DB.DistributionOfNormals.OnePerFace

There is only one common normal vector assigned to the face/polymesh.